[NoCoverage] ObjectLiteral
src/Model/AutorModel.js:6:30
 
 const prisma = new PrismaClient()
 
-const autorSchema = z.object({
-    nome: z.string({
-        required_error: "O nome é obrigatório",
-        invalid_type_error: "O nome deve ser uma string"
-    })
-})
+const autorSchema = z.object({})
 
 export const autorValidator = (autor, partial = null) => {

[NoCoverage] StringLiteral
src/Model/AutorModel.js:9:29
 const autorSchema = z.object({
     nome: z.string({
         required_error: "O nome é obrigatório",
-        invalid_type_error: "O nome deve ser uma string"
+        invalid_type_error: ""
     })
 })

[NoCoverage] BlockStatement
src/Model/AutorModel.js:13:58
     })
 })
 
-export const autorValidator = (autor, partial = null) => {
-    if (partial) {
-        return autorSchema.partial(partial).safeParse(autor)
-    }
-
-    return autorSchema.safeParse(autor)
-}
+export const autorValidator = (autor, partial = null) => {}
 
 export async function createAutor(autor) {

[NoCoverage] BlockStatement
src/Model/AutorModel.js:14:18
 })
 
 export const autorValidator = (autor, partial = null) => {
-    if (partial) {
-        return autorSchema.partial(partial).safeParse(autor)
-    }
+    if (partial) {}
 
     return autorSchema.safeParse(autor)

[NoCoverage] ConditionalExpression
src/Model/AutorModel.js:14:9
 })
 
 export const autorValidator = (autor, partial = null) => {
-    if (partial) {
+    if (true) {
         return autorSchema.partial(partial).safeParse(autor)
     }

[NoCoverage] BlockStatement
src/Model/AutorModel.js:21:42
     return autorSchema.safeParse(autor)
 }
 
-export async function createAutor(autor) {
-    const result = await prisma.Autor.create({
-        data: autor,
-        select: {
-            id: true,
-            nome: true
-        }
-    })
-    
-    return result
-}
+export async function createAutor(autor) {}
 
 export async function listAutor() {

[NoCoverage] ObjectLiteral
src/Model/AutorModel.js:24:17
 export async function createAutor(autor) {
     const result = await prisma.Autor.create({
         data: autor,
-        select: {
-            id: true,
-            nome: true
-        }
+        select: {}
     })
     

[NoCoverage] BooleanLiteral
src/Model/AutorModel.js:26:19
         data: autor,
         select: {
             id: true,
-            nome: true
+            nome: false
         }
     })

[NoCoverage] BlockStatement
src/Model/AutorModel.js:33:35
     return result
 }
 
-export async function listAutor() {
-    const result = await prisma.Autor.findMany({
-        select: {
-            id: true,
-            nome: true
-        }
-    })
-
-    return result
-}
+export async function listAutor() {}
 
 export async function getAutorById(id) {

[NoCoverage] BlockStatement
src/Model/AutorModel.js:44:40
     return result
 }
 
-export async function getAutorById(id) {
-    const result = await prisma.Autor.findUnique({
-        where: {
-            id: id
-        },
-        select: {
-            id: true,
-            nome: true
-        }
-    })
-    
-    return result
-}
+export async function getAutorById(id) {}
 
 export async function deleteAutor(id) {

[NoCoverage] ObjectLiteral
src/Model/AutorModel.js:49:17
         where: {
             id: id
         },
-        select: {
-            id: true,
-            nome: true
-        }
+        select: {}
     })
     

[NoCoverage] BlockStatement
src/Model/AutorModel.js:58:39
     return result
 }
 
-export async function deleteAutor(id) {
-    const result = await prisma.Autor.delete({
-        where: {
-            id: id
-        }, select: {
-            id: true,
-            nome: true
-        }
-    })
-
-    return result
-}
+export async function deleteAutor(id) {}
 
 export async function updateAutor(id, autor) {

[NoCoverage] ObjectLiteral
src/Model/AutorModel.js:59:46
 }
 
 export async function deleteAutor(id) {
-    const result = await prisma.Autor.delete({
-        where: {
-            id: id
-        }, select: {
-            id: true,
-            nome: true
-        }
-    })
+    const result = await prisma.Autor.delete({})
 
     return result

[NoCoverage] ObjectLiteral
src/Model/AutorModel.js:60:16
 
 export async function deleteAutor(id) {
     const result = await prisma.Autor.delete({
-        where: {
-            id: id
-        }, select: {
+        where: {}, select: {
             id: true,
             nome: true

[NoCoverage] ObjectLiteral
src/Model/AutorModel.js:62:20
     const result = await prisma.Autor.delete({
         where: {
             id: id
-        }, select: {
-            id: true,
-            nome: true
-        }
+        }, select: {}
     })
 

[NoCoverage] BooleanLiteral
src/Model/AutorModel.js:63:17
         where: {
             id: id
         }, select: {
-            id: true,
+            id: false,
             nome: true
         }

[NoCoverage] BlockStatement
src/Model/AutorModel.js:71:46
     return result
 }
 
-export async function updateAutor(id, autor) {
-    const result = await prisma.Autor.update({
-        where: {
-            id: id
-        },
-        data: autor,
-        select: {
-            id: true,
-            nome: true
-        }
-    })
-
-    return result
-}
+export async function updateAutor(id, autor) {}

[NoCoverage] ObjectLiteral
src/Model/AutorModel.js:72:46
 }
 
 export async function updateAutor(id, autor) {
-    const result = await prisma.Autor.update({
-        where: {
-            id: id
-        },
-        data: autor,
-        select: {
-            id: true,
-            nome: true
-        }
-    })
+    const result = await prisma.Autor.update({})
 
     return result
