[NoCoverage] BlockStatement
src/Model/BibliotecarioModel.js:5:54
 
 const prisma = new PrismaClient()
 
-export async function createBibliotecario(id_usuario){
-    const result = await prisma.Bibliotecario.create({
-        data: id_usuario,
-        select: {
-            id: true,
-            id_usuario: true
-        }
-    })
-
-    return result
-}
+export async function createBibliotecario(id_usuario){}
 
 export async function listBibliotecario() {

[NoCoverage] ObjectLiteral
src/Model/BibliotecarioModel.js:6:54
 const prisma = new PrismaClient()
 
 export async function createBibliotecario(id_usuario){
-    const result = await prisma.Bibliotecario.create({
-        data: id_usuario,
-        select: {
-            id: true,
-            id_usuario: true
-        }
-    })
+    const result = await prisma.Bibliotecario.create({})
 
     return result

[NoCoverage] BooleanLiteral
src/Model/BibliotecarioModel.js:10:25
         data: id_usuario,
         select: {
             id: true,
-            id_usuario: true
+            id_usuario: false
         }
     })

[NoCoverage] BlockStatement
src/Model/BibliotecarioModel.js:17:43
     return result
 }
 
-export async function listBibliotecario() {
-    const result = await prisma.Bibliotecario.findMany({
-        select: {
-            id: true,
-            id_usuario: true
-        }
-    })
-
-    return result
-}
+export async function listBibliotecario() {}
 
 export async function getBibliotecarioById(id) {

[NoCoverage] ObjectLiteral
src/Model/BibliotecarioModel.js:19:17
 
 export async function listBibliotecario() {
     const result = await prisma.Bibliotecario.findMany({
-        select: {
-            id: true,
-            id_usuario: true
-        }
+        select: {}
     })
 

[NoCoverage] BlockStatement
src/Model/BibliotecarioModel.js:28:48
     return result
 }
 
-export async function getBibliotecarioById(id) {
-    const result = await prisma.Bibliotecario.findUnique({
-        where: {
-            id: id
-        }, select: {
-            id: true,
-            id_usuario: true
-        }
-    })
-
-    return result
-}
+export async function getBibliotecarioById(id) {}
 
 export async function deleteBibliotecario(id) {

[NoCoverage] ObjectLiteral
src/Model/BibliotecarioModel.js:32:20
     const result = await prisma.Bibliotecario.findUnique({
         where: {
             id: id
-        }, select: {
-            id: true,
-            id_usuario: true
-        }
+        }, select: {}
     })
 

[NoCoverage] BlockStatement
src/Model/BibliotecarioModel.js:41:47
     return result
 }
 
-export async function deleteBibliotecario(id) {
-    const result = await prisma.Bibliotecario.delete({
-        where: {
-            id: id
-        }, select: {
-            id: true,
-            id_usuario: true
-        }
-    })
-
-    return result
-}
+export async function deleteBibliotecario(id) {}
 
