[Survived] ObjectLiteral
src/Model/CddModel.js:6:32
 
 const prisma = new PrismaClient()
 
-const cddSchema = new z.object({
-    descricao: z.string({
-        invalid_type_error: "A descrição deve ser um valor tipo texto",
-        required_error: "A descrição deve ser obrigatoria"
-    })
-})
+const cddSchema = new z.object({})
 
 export const cddValidator = (cdd, partial = null) => {

[Survived] ObjectLiteral
src/Model/CddModel.js:7:25
 const prisma = new PrismaClient()
 
 const cddSchema = new z.object({
-    descricao: z.string({
-        invalid_type_error: "A descrição deve ser um valor tipo texto",
-        required_error: "A descrição deve ser obrigatoria"
-    })
+    descricao: z.string({})
 })
 

[NoCoverage] BlockStatement
src/Model/CddModel.js:13:54
     })
 })
 
-export const cddValidator = (cdd, partial = null) => {
-    if (partial) {
-        return cddSchema.partial(partial).safeParse(cdd)
-    }
-
-    return cddSchema.safeParse(cdd)
-}
+export const cddValidator = (cdd, partial = null) => {}
 
 export async function createCdd(cdd) {

[NoCoverage] ConditionalExpression
src/Model/CddModel.js:14:9
 })
 
 export const cddValidator = (cdd, partial = null) => {
-    if (partial) {
+    if (false) {
         return cddSchema.partial(partial).safeParse(cdd)
     }

[NoCoverage] ConditionalExpression
src/Model/CddModel.js:14:9
 })
 
 export const cddValidator = (cdd, partial = null) => {
-    if (partial) {
+    if (true) {
         return cddSchema.partial(partial).safeParse(cdd)
     }

[NoCoverage] BlockStatement
src/Model/CddModel.js:21:38
     return cddSchema.safeParse(cdd)
 }
 
-export async function createCdd(cdd) {
-    const result = await prisma.Cdd.create({
-        data: cdd,
-        select: {
-            id: true,
-            descricao: true
-        }
-    })
-
-    return result
-}
+export async function createCdd(cdd) {}
 
 export async function listCdd() {

[NoCoverage] ObjectLiteral
src/Model/CddModel.js:24:17
 export async function createCdd(cdd) {
     const result = await prisma.Cdd.create({
         data: cdd,
-        select: {
-            id: true,
-            descricao: true
-        }
+        select: {}
     })
 

[NoCoverage] BooleanLiteral
src/Model/CddModel.js:26:24
         data: cdd,
         select: {
             id: true,
-            descricao: true
+            descricao: false
         }
     })

[Killed] BlockStatement
src/Model/CddModel.js:33:33
     return result
 }
 
-export async function listCdd() {
-    const result = await prisma.Cdd.findMany({
-        select: {
-            id: true,
-            descricao: true
-        }
-    })
-
-    return result
-}
+export async function listCdd() {}
 
 export async function getCddById(id) {
killedBy: CddModel should list Cdds
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"descricao": "Informatica", "id": "000"}]
Received: undefined

[Survived] ObjectLiteral
src/Model/CddModel.js:35:17
 
 export async function listCdd() {
     const result = await prisma.Cdd.findMany({
-        select: {
-            id: true,
-            descricao: true
-        }
+        select: {}
     })
 

[NoCoverage] BlockStatement
src/Model/CddModel.js:44:38
     return result
 }
 
-export async function getCddById(id) {
-    const result = await prisma.Cdd.findUnique({
-        where: {
-            id: id
-        },
-        select: {
-            id: true,
-            descricao: true
-        }
-    })
-
-    return result
-}
+export async function getCddById(id) {}
 
 export async function deleteCdd(id) {

[NoCoverage] ObjectLiteral
src/Model/CddModel.js:49:17
         where: {
             id: id
         },
-        select: {
-            id: true,
-            descricao: true
-        }
+        select: {}
     })
 

[NoCoverage] BlockStatement
src/Model/CddModel.js:58:37
     return result
 }
 
-export async function deleteCdd(id) {
-    const result = await prisma.Cdd.delete({
-        where: {
-            id: id
-        },
-        select: {
-            id: true,
-            descricao: true
-        }
-    })
-
-    return result
-}  
+export async function deleteCdd(id) {}  
 
 export async function updateCdd(id, cdd) {

[NoCoverage] ObjectLiteral
src/Model/CddModel.js:60:16
 
 export async function deleteCdd(id) {
     const result = await prisma.Cdd.delete({
-        where: {
-            id: id
-        },
+        where: {},
         select: {
             id: true,

[NoCoverage] BlockStatement
src/Model/CddModel.js:72:42
     return result
 }  
 
-export async function updateCdd(id, cdd) {
-    const result = await prisma.Cdd.update({
-        where: {
-            id: id
-        },
-        data: cdd,
-        select: {
-            id: true,
-            descricao: true
-        }
-    })
-
-    return result
-}
+export async function updateCdd(id, cdd) {}
 

[NoCoverage] ObjectLiteral
src/Model/CddModel.js:74:16
 
 export async function updateCdd(id, cdd) {
     const result = await prisma.Cdd.update({
-        where: {
-            id: id
-        },
+        where: {},
         data: cdd,
         select: {
