[NoCoverage] ObjectLiteral
src/Model/EmprestimoModel.js:8:24
 const prisma = new PrismaClient();
 
 const emprestimoSchema = z.object({
-    dataInicio: z.date({
-        invalid_type_error: "A data de início do empréstimo deve ser uma data válida!"
-    })
+    dataInicio: z.date({})
     .default(() => new Date())
     .optional(),

[NoCoverage] StringLiteral
src/Model/EmprestimoModel.js:9:29
 
 const emprestimoSchema = z.object({
     dataInicio: z.date({
-        invalid_type_error: "A data de início do empréstimo deve ser uma data válida!"
+        invalid_type_error: ""
     })
     .default(() => new Date())

[NoCoverage] ArrowFunction
src/Model/EmprestimoModel.js:11:14
     dataInicio: z.date({
         invalid_type_error: "A data de início do empréstimo deve ser uma data válida!"
     })
-    .default(() => new Date())
+    .default(() => undefined)
     .optional(),
 

[NoCoverage] BlockStatement
src/Model/EmprestimoModel.js:21:68
     .positive("A quantidade de dias para locação deve ser um número positivo!")
 })
 
-export const emprestimoValidator = (emprestimo, partial = null) => {
-    if (partial) {
-        return emprestimoSchema.partial(partial).safeParse(emprestimo)
-    }
-
-    return emprestimoSchema.safeParse(emprestimo)
-}
+export const emprestimoValidator = (emprestimo, partial = null) => {}
 
 export async function createEmprestimo(emprestimo) {

[NoCoverage] ConditionalExpression
src/Model/EmprestimoModel.js:22:9
 })
 
 export const emprestimoValidator = (emprestimo, partial = null) => {
-    if (partial) {
+    if (true) {
         return emprestimoSchema.partial(partial).safeParse(emprestimo)
     }

[NoCoverage] ConditionalExpression
src/Model/EmprestimoModel.js:22:9
 })
 
 export const emprestimoValidator = (emprestimo, partial = null) => {
-    if (partial) {
+    if (false) {
         return emprestimoSchema.partial(partial).safeParse(emprestimo)
     }

[NoCoverage] BlockStatement
src/Model/EmprestimoModel.js:29:52
     return emprestimoSchema.safeParse(emprestimo)
 }
 
-export async function createEmprestimo(emprestimo) {
-    const { diasLocacao, id_leitor, id_exemplar, dataInicio } = emprestimo
-
-    const result = await prisma.Emprestimo.create({
-        data: {
-            diasLocacao,
-            id_leitor,
-            id_exemplar,
-            dataInicio: dataInicio ? new Date(dataInicio) : new Date()
-        },
-        select: {
-            id: true,
-            dataInicio: true,
-            diasLocacao: true,
-            id_leitor: true,
-            id_exemplar: true
-        }
-    })
-    
-    return result
-}
+export async function createEmprestimo(emprestimo) {}
 
 export async function listEmprestimo() {

[NoCoverage] ObjectLiteral
src/Model/EmprestimoModel.js:39:17
             id_exemplar,
             dataInicio: dataInicio ? new Date(dataInicio) : new Date()
         },
-        select: {
-            id: true,
-            dataInicio: true,
-            diasLocacao: true,
-            id_leitor: true,
-            id_exemplar: true
-        }
+        select: {}
     })
     

[NoCoverage] BooleanLiteral
src/Model/EmprestimoModel.js:41:25
         },
         select: {
             id: true,
-            dataInicio: true,
+            dataInicio: false,
             diasLocacao: true,
             id_leitor: true,

[NoCoverage] BooleanLiteral
src/Model/EmprestimoModel.js:42:26
         select: {
             id: true,
             dataInicio: true,
-            diasLocacao: true,
+            diasLocacao: false,
             id_leitor: true,
             id_exemplar: true

[NoCoverage] BooleanLiteral
src/Model/EmprestimoModel.js:43:24
             id: true,
             dataInicio: true,
             diasLocacao: true,
-            id_leitor: true,
+            id_leitor: false,
             id_exemplar: true
         }

[NoCoverage] BooleanLiteral
src/Model/EmprestimoModel.js:44:26
             dataInicio: true,
             diasLocacao: true,
             id_leitor: true,
-            id_exemplar: true
+            id_exemplar: false
         }
     })

[NoCoverage] BlockStatement
src/Model/EmprestimoModel.js:51:40
     return result
 }
 
-export async function listEmprestimo() {
-    const result = await prisma.Emprestimo.findMany({
-        select: {
-            id: true,
-            dataInicio: true,
-            diasLocacao: true,
-            id_leitor: true,
-            id_exemplar: true
-        }
-    })
-
-    return result
-}
+export async function listEmprestimo() {}
 
 export async function getEmprestimoById(id) {

[NoCoverage] ObjectLiteral
src/Model/EmprestimoModel.js:53:17
 
 export async function listEmprestimo() {
     const result = await prisma.Emprestimo.findMany({
-        select: {
-            id: true,
-            dataInicio: true,
-            diasLocacao: true,
-            id_leitor: true,
-            id_exemplar: true
-        }
+        select: {}
     })
 

[NoCoverage] BlockStatement
src/Model/EmprestimoModel.js:65:45
     return result
 }
 
-export async function getEmprestimoById(id) {
-    const result = await prisma.Emprestimo.findUnique({
-        where: {
-            id: id
-        }, select: {
-            id: true,
-            dataInicio: true,
-            diasLocacao: true,
-            id_leitor: true,
-            id_exemplar: true
-        }
-    })
-
-    return result
-}
+export async function getEmprestimoById(id) {}
 
 export async function deleteEmprestimo(id) {

[NoCoverage] ObjectLiteral
src/Model/EmprestimoModel.js:66:55
 }
 
 export async function getEmprestimoById(id) {
-    const result = await prisma.Emprestimo.findUnique({
-        where: {
-            id: id
-        }, select: {
-            id: true,
-            dataInicio: true,
-            diasLocacao: true,
-            id_leitor: true,
-            id_exemplar: true
-        }
-    })
+    const result = await prisma.Emprestimo.findUnique({})
 
     return result

[NoCoverage] ObjectLiteral
src/Model/EmprestimoModel.js:67:16
 
 export async function getEmprestimoById(id) {
     const result = await prisma.Emprestimo.findUnique({
-        where: {
-            id: id
-        }, select: {
+        where: {}, select: {
             id: true,
             dataInicio: true,

[NoCoverage] ObjectLiteral
src/Model/EmprestimoModel.js:69:20
     const result = await prisma.Emprestimo.findUnique({
         where: {
             id: id
-        }, select: {
-            id: true,
-            dataInicio: true,
-            diasLocacao: true,
-            id_leitor: true,
-            id_exemplar: true
-        }
+        }, select: {}
     })
 

[NoCoverage] BlockStatement
src/Model/EmprestimoModel.js:81:44
     return result
 }
 
-export async function deleteEmprestimo(id) {
-    const result = await prisma.Emprestimo.delete({
-        where: {
-            id: id
-        }, select: {
-            id: true,
-            dataInicio: true,
-            diasLocacao: true,
-            id_leitor: true,
-            id_exemplar: true
-        }
-    })
-
-    return result
-}
+export async function deleteEmprestimo(id) {}
 
 export async function updateEmprestimo(id, emprestimo) {

[NoCoverage] BlockStatement
src/Model/EmprestimoModel.js:97:56
     return result
 }
 
-export async function updateEmprestimo(id, emprestimo) {
-    const result = await prisma.Emprestimo.delete({
-        where: {
-            id: id
-        }, 
-        data: emprestimo,
-        select: {
-            id: true,
-            dataInicio: true,
-            diasLocacao: true,
-            id_leitor: true,
-            id_exemplar: true
-        }
-    })
-
-    return result
-}
+export async function updateEmprestimo(id, emprestimo) {}

[NoCoverage] ObjectLiteral
src/Model/EmprestimoModel.js:99:16
 
 export async function updateEmprestimo(id, emprestimo) {
     const result = await prisma.Emprestimo.delete({
-        where: {
-            id: id
-        }, 
+        where: {}, 
         data: emprestimo,
         select: {

[NoCoverage] ObjectLiteral
src/Model/EmprestimoModel.js:103:17
             id: id
         }, 
         data: emprestimo,
-        select: {
-            id: true,
-            dataInicio: true,
-            diasLocacao: true,
-            id_leitor: true,
-            id_exemplar: true
-        }
+        select: {}
     })
 
