[NoCoverage] ObjectLiteral
src/Model/ExemplarModel.js:6:37
 
 const prisma = new PrismaClient()
 
-const exemplarSchema = new z.object({
-    numeroInventario: z.string({
-        invalid_type_error: "O número de inventário deve ser um valor tipo string",
-        required_error: "O número de inventário deve ser obrigatorio"
-    }),
-
-    disponivel: z.boolean().default(true)
-})
+const exemplarSchema = new z.object({})
 
 export const exemplarValidator = (exemplar, partial = null) => {

[NoCoverage] StringLiteral
src/Model/ExemplarModel.js:8:29
 
 const exemplarSchema = new z.object({
     numeroInventario: z.string({
-        invalid_type_error: "O número de inventário deve ser um valor tipo string",
+        invalid_type_error: "",
         required_error: "O número de inventário deve ser obrigatorio"
     }),

[NoCoverage] StringLiteral
src/Model/ExemplarModel.js:9:25
 const exemplarSchema = new z.object({
     numeroInventario: z.string({
         invalid_type_error: "O número de inventário deve ser um valor tipo string",
-        required_error: "O número de inventário deve ser obrigatorio"
+        required_error: ""
     }),
 

[NoCoverage] BooleanLiteral
src/Model/ExemplarModel.js:12:37
         required_error: "O número de inventário deve ser obrigatorio"
     }),
 
-    disponivel: z.boolean().default(true)
+    disponivel: z.boolean().default(false)
 })
 

[NoCoverage] BlockStatement
src/Model/ExemplarModel.js:15:64
     disponivel: z.boolean().default(true)
 })
 
-export const exemplarValidator = (exemplar, partial = null) => {
-    if (partial) {
-        return exemplarSchema.partial(partial).safeParse(exemplar)
-    }
-
-    return exemplarSchema.safeParse(exemplar)
-}
+export const exemplarValidator = (exemplar, partial = null) => {}
 
 export async function createExemplar(exemplar) {

[NoCoverage] ConditionalExpression
src/Model/ExemplarModel.js:16:9
 })
 
 export const exemplarValidator = (exemplar, partial = null) => {
-    if (partial) {
+    if (true) {
         return exemplarSchema.partial(partial).safeParse(exemplar)
     }

[NoCoverage] ConditionalExpression
src/Model/ExemplarModel.js:16:9
 })
 
 export const exemplarValidator = (exemplar, partial = null) => {
-    if (partial) {
+    if (false) {
         return exemplarSchema.partial(partial).safeParse(exemplar)
     }

[NoCoverage] BlockStatement
src/Model/ExemplarModel.js:23:48
     return exemplarSchema.safeParse(exemplar)
 }
 
-export async function createExemplar(exemplar) {
-    const result = await prisma.Exemplar.create({
-        data: exemplar,
-        select: {
-            id: true,
-            id_obra: true,
-            numeroInventario: true,
-            disponivel: true
-        }
-    })
-
-    return result
-}
+export async function createExemplar(exemplar) {}
 
 export async function listExemplar() {

[NoCoverage] ObjectLiteral
src/Model/ExemplarModel.js:24:49
 }
 
 export async function createExemplar(exemplar) {
-    const result = await prisma.Exemplar.create({
-        data: exemplar,
-        select: {
-            id: true,
-            id_obra: true,
-            numeroInventario: true,
-            disponivel: true
-        }
-    })
+    const result = await prisma.Exemplar.create({})
 
     return result

[NoCoverage] ObjectLiteral
src/Model/ExemplarModel.js:26:17
 export async function createExemplar(exemplar) {
     const result = await prisma.Exemplar.create({
         data: exemplar,
-        select: {
-            id: true,
-            id_obra: true,
-            numeroInventario: true,
-            disponivel: true
-        }
+        select: {}
     })
 

[NoCoverage] BooleanLiteral
src/Model/ExemplarModel.js:28:22
         data: exemplar,
         select: {
             id: true,
-            id_obra: true,
+            id_obra: false,
             numeroInventario: true,
             disponivel: true

[NoCoverage] BooleanLiteral
src/Model/ExemplarModel.js:29:31
         select: {
             id: true,
             id_obra: true,
-            numeroInventario: true,
+            numeroInventario: false,
             disponivel: true
         }

[NoCoverage] BooleanLiteral
src/Model/ExemplarModel.js:30:25
             id: true,
             id_obra: true,
             numeroInventario: true,
-            disponivel: true
+            disponivel: false
         }
     })

[NoCoverage] BlockStatement
src/Model/ExemplarModel.js:37:38
     return result
 }
 
-export async function listExemplar() {
-    const result = await prisma.Exemplar.findMany({
-        select: {
-            id: true,
-            id_obra: true,
-            numeroInventario: true,
-            disponivel: true
-        }
-    })
-
-    return result
-}
+export async function listExemplar() {}
 
 export async function getExemplarById(id) {

[NoCoverage] BlockStatement
src/Model/ExemplarModel.js:50:43
     return result
 }
 
-export async function getExemplarById(id) {
-    const result = await prisma.Exemplar.findUnique({
-        where: {
-            id: id
-        }, select: {
-            id: true,
-            id_obra: true,
-            numeroInventario: true,
-            disponivel: true
-        }
-    })
-
-    return result
-}
+export async function getExemplarById(id) {}
 
 export async function deleteExemplar(id) {

[NoCoverage] BlockStatement
src/Model/ExemplarModel.js:65:42
     return result
 }
 
-export async function deleteExemplar(id) {
-    const result = await prisma.Exemplar.delete({
-        where: {
-            id: id
-        }, select: {
-            id: true,
-            id_obra: true,
-            numeroInventario: true,
-            disponivel: true
-        }
-    })
-
-    return result
-}
+export async function deleteExemplar(id) {}
 
 export async function updateExemplar(id, exemplar) {

[NoCoverage] BlockStatement
src/Model/ExemplarModel.js:80:52
     return result
 }
 
-export async function updateExemplar(id, exemplar) {
-    const result = await prisma.Exemplar.update({
-        where: {
-            id: id
-        }, 
-        data: exemplar,
-        select: {
-            id: true,
-            id_obra: true,
-            numeroInventario: true,
-            disponivel: true
-        }
-    })
-
-    return result
-}
+export async function updateExemplar(id, exemplar) {}
