[NoCoverage] StringLiteral
src/Model/LeitorModel.js:8:29
 
 const leitorSchema = new z.object({
     cpf: z.string({
-        invalid_type_error: "O CPF deve ser um valor tipo número",
+        invalid_type_error: "",
         required_error: "O CPF deve ser obrigatorio"
     })

[NoCoverage] MethodExpression
src/Model/LeitorModel.js:13:15
     })
         .length(11, "O CPF deve ter 11 caracteres"),
 
-    telefone: z.string({
-        invalid_type_error: "O CPF deve ser um valor tipo número",
-        required_error: "O CPF deve ser obrigatorio"
-    })
-        .max(11, "O telefone deve ter no máximo 11 caracteres")
+    telefone: z.string({
+  invalid_type_error: "O CPF deve ser um valor tipo número",
+  required_error: "O CPF deve ser obrigatorio"
+}).min(11, "O telefone deve ter no máximo 11 caracteres")
         .min(10, "o telefone deve ter no mínimo 10 caracteres")
 })

[NoCoverage] MethodExpression
src/Model/LeitorModel.js:13:15
     })
         .length(11, "O CPF deve ter 11 caracteres"),
 
-    telefone: z.string({
-        invalid_type_error: "O CPF deve ser um valor tipo número",
-        required_error: "O CPF deve ser obrigatorio"
-    })
-        .max(11, "O telefone deve ter no máximo 11 caracteres")
-        .min(10, "o telefone deve ter no mínimo 10 caracteres")
+    telefone: z.string({
+  invalid_type_error: "O CPF deve ser um valor tipo número",
+  required_error: "O CPF deve ser obrigatorio"
+}).max(11, "O telefone deve ter no máximo 11 caracteres").max(10, "o telefone deve ter no mínimo 10 caracteres")
 })
 

[NoCoverage] StringLiteral
src/Model/LeitorModel.js:15:25
 
     telefone: z.string({
         invalid_type_error: "O CPF deve ser um valor tipo número",
-        required_error: "O CPF deve ser obrigatorio"
+        required_error: ""
     })
         .max(11, "O telefone deve ter no máximo 11 caracteres")

[NoCoverage] StringLiteral
src/Model/LeitorModel.js:18:18
         required_error: "O CPF deve ser obrigatorio"
     })
         .max(11, "O telefone deve ter no máximo 11 caracteres")
-        .min(10, "o telefone deve ter no mínimo 10 caracteres")
+        .min(10, "")
 })
 

[NoCoverage] BlockStatement
src/Model/LeitorModel.js:21:60
         .min(10, "o telefone deve ter no mínimo 10 caracteres")
 })
 
-export const leitorValidator = (leitor, partial = null) => {
-    if (partial) {
-        return leitorSchema.partial(partial).safeParse(leitor)
-    }
-
-    return leitorSchema.safeParse(leitor)
-}
+export const leitorValidator = (leitor, partial = null) => {}
 
 export function validarCPF(cpf) {

[NoCoverage] BlockStatement
src/Model/LeitorModel.js:22:18
 })
 
 export const leitorValidator = (leitor, partial = null) => {
-    if (partial) {
-        return leitorSchema.partial(partial).safeParse(leitor)
-    }
+    if (partial) {}
 
     return leitorSchema.safeParse(leitor)

[NoCoverage] ConditionalExpression
src/Model/LeitorModel.js:22:9
 })
 
 export const leitorValidator = (leitor, partial = null) => {
-    if (partial) {
+    if (false) {
         return leitorSchema.partial(partial).safeParse(leitor)
     }

[NoCoverage] BlockStatement
src/Model/LeitorModel.js:29:33
     return leitorSchema.safeParse(leitor)
 }
 
-export function validarCPF(cpf) {
-    if (/^(\d)\1{10}$/.test(cpf)) return false;
-
-    const calcDigito = (cpf, tamanho) => {
-        const soma = Array.from({ length: tamanho }, (_, i) => parseInt(cpf[i]) * (tamanho + 1 - i))
-            .reduce((acc, val) => acc + val, 0);
-        const resto = soma % 11;
-        return resto < 2 ? 0 : 11 - resto;
-    };
-
-    const dig1Valido = calcDigito(cpf, 9) === parseInt(cpf[9]);
-    const dig2Valido = calcDigito(cpf, 10) === parseInt(cpf[10]);
-
-    return dig1Valido && dig2Valido;
-}
+export function validarCPF(cpf) {}
 
 export async function createLeitor(leitor) {

[NoCoverage] BooleanLiteral
src/Model/LeitorModel.js:30:42
 }
 
 export function validarCPF(cpf) {
-    if (/^(\d)\1{10}$/.test(cpf)) return false;
+    if (/^(\d)\1{10}$/.test(cpf)) return true;
 
     const calcDigito = (cpf, tamanho) => {

[NoCoverage] ConditionalExpression
src/Model/LeitorModel.js:30:9
 }
 
 export function validarCPF(cpf) {
-    if (/^(\d)\1{10}$/.test(cpf)) return false;
+    if (true) return false;
 
     const calcDigito = (cpf, tamanho) => {

[NoCoverage] BlockStatement
src/Model/LeitorModel.js:32:42
 export function validarCPF(cpf) {
     if (/^(\d)\1{10}$/.test(cpf)) return false;
 
-    const calcDigito = (cpf, tamanho) => {
-        const soma = Array.from({ length: tamanho }, (_, i) => parseInt(cpf[i]) * (tamanho + 1 - i))
-            .reduce((acc, val) => acc + val, 0);
-        const resto = soma % 11;
-        return resto < 2 ? 0 : 11 - resto;
-    };
+    const calcDigito = (cpf, tamanho) => {};
 
     const dig1Valido = calcDigito(cpf, 9) === parseInt(cpf[9]);

[NoCoverage] ArrowFunction
src/Model/LeitorModel.js:33:54
     if (/^(\d)\1{10}$/.test(cpf)) return false;
 
     const calcDigito = (cpf, tamanho) => {
-        const soma = Array.from({ length: tamanho }, (_, i) => parseInt(cpf[i]) * (tamanho + 1 - i))
+        const soma = Array.from({ length: tamanho }, () => undefined)
             .reduce((acc, val) => acc + val, 0);
         const resto = soma % 11;

[NoCoverage] ArithmeticOperator
src/Model/LeitorModel.js:33:64
     if (/^(\d)\1{10}$/.test(cpf)) return false;
 
     const calcDigito = (cpf, tamanho) => {
-        const soma = Array.from({ length: tamanho }, (_, i) => parseInt(cpf[i]) * (tamanho + 1 - i))
+        const soma = Array.from({ length: tamanho }, (_, i) => parseInt(cpf[i]) / (tamanho + 1 - i))
             .reduce((acc, val) => acc + val, 0);
         const resto = soma % 11;

[NoCoverage] ArithmeticOperator
src/Model/LeitorModel.js:34:35
 
     const calcDigito = (cpf, tamanho) => {
         const soma = Array.from({ length: tamanho }, (_, i) => parseInt(cpf[i]) * (tamanho + 1 - i))
-            .reduce((acc, val) => acc + val, 0);
+            .reduce((acc, val) => acc - val, 0);
         const resto = soma % 11;
         return resto < 2 ? 0 : 11 - resto;

[NoCoverage] ArrowFunction
src/Model/LeitorModel.js:34:21
 
     const calcDigito = (cpf, tamanho) => {
         const soma = Array.from({ length: tamanho }, (_, i) => parseInt(cpf[i]) * (tamanho + 1 - i))
-            .reduce((acc, val) => acc + val, 0);
+            .reduce(() => undefined, 0);
         const resto = soma % 11;
         return resto < 2 ? 0 : 11 - resto;

[NoCoverage] ArithmeticOperator
src/Model/LeitorModel.js:35:23
     const calcDigito = (cpf, tamanho) => {
         const soma = Array.from({ length: tamanho }, (_, i) => parseInt(cpf[i]) * (tamanho + 1 - i))
             .reduce((acc, val) => acc + val, 0);
-        const resto = soma % 11;
+        const resto = soma * 11;
         return resto < 2 ? 0 : 11 - resto;
     };

[NoCoverage] EqualityOperator
src/Model/LeitorModel.js:36:16
         const soma = Array.from({ length: tamanho }, (_, i) => parseInt(cpf[i]) * (tamanho + 1 - i))
             .reduce((acc, val) => acc + val, 0);
         const resto = soma % 11;
-        return resto < 2 ? 0 : 11 - resto;
+        return resto >= 2 ? 0 : 11 - resto;
     };
 

[NoCoverage] EqualityOperator
src/Model/LeitorModel.js:36:16
         const soma = Array.from({ length: tamanho }, (_, i) => parseInt(cpf[i]) * (tamanho + 1 - i))
             .reduce((acc, val) => acc + val, 0);
         const resto = soma % 11;
-        return resto < 2 ? 0 : 11 - resto;
+        return resto <= 2 ? 0 : 11 - resto;
     };
 

[NoCoverage] ConditionalExpression
src/Model/LeitorModel.js:39:24
         return resto < 2 ? 0 : 11 - resto;
     };
 
-    const dig1Valido = calcDigito(cpf, 9) === parseInt(cpf[9]);
+    const dig1Valido = true;
     const dig2Valido = calcDigito(cpf, 10) === parseInt(cpf[10]);
 

[NoCoverage] EqualityOperator
src/Model/LeitorModel.js:39:24
         return resto < 2 ? 0 : 11 - resto;
     };
 
-    const dig1Valido = calcDigito(cpf, 9) === parseInt(cpf[9]);
+    const dig1Valido = calcDigito(cpf, 9) !== parseInt(cpf[9]);
     const dig2Valido = calcDigito(cpf, 10) === parseInt(cpf[10]);
 

[NoCoverage] ConditionalExpression
src/Model/LeitorModel.js:40:24
     };
 
     const dig1Valido = calcDigito(cpf, 9) === parseInt(cpf[9]);
-    const dig2Valido = calcDigito(cpf, 10) === parseInt(cpf[10]);
+    const dig2Valido = false;
 
     return dig1Valido && dig2Valido;

[NoCoverage] EqualityOperator
src/Model/LeitorModel.js:40:24
     };
 
     const dig1Valido = calcDigito(cpf, 9) === parseInt(cpf[9]);
-    const dig2Valido = calcDigito(cpf, 10) === parseInt(cpf[10]);
+    const dig2Valido = calcDigito(cpf, 10) !== parseInt(cpf[10]);
 
     return dig1Valido && dig2Valido;

[NoCoverage] LogicalOperator
src/Model/LeitorModel.js:42:12
     const dig1Valido = calcDigito(cpf, 9) === parseInt(cpf[9]);
     const dig2Valido = calcDigito(cpf, 10) === parseInt(cpf[10]);
 
-    return dig1Valido && dig2Valido;
+    return dig1Valido || dig2Valido;
 }
 

[NoCoverage] ConditionalExpression
src/Model/LeitorModel.js:42:12
     const dig1Valido = calcDigito(cpf, 9) === parseInt(cpf[9]);
     const dig2Valido = calcDigito(cpf, 10) === parseInt(cpf[10]);
 
-    return dig1Valido && dig2Valido;
+    return false;
 }
 

[NoCoverage] BlockStatement
src/Model/LeitorModel.js:45:44
     return dig1Valido && dig2Valido;
 }
 
-export async function createLeitor(leitor) {
-    const result = await prisma.Leitor.create({
-        data: leitor,
-        select: {
-            id: true,
-            id_usuario: true,
-            cpf: false,
-            telefone: true
-        }
-    })
-
-    return result
-}
+export async function createLeitor(leitor) {}
 
 export async function listLeitor() {

[NoCoverage] BooleanLiteral
src/Model/LeitorModel.js:50:25
         data: leitor,
         select: {
             id: true,
-            id_usuario: true,
+            id_usuario: false,
             cpf: false,
             telefone: true

[NoCoverage] BooleanLiteral
src/Model/LeitorModel.js:51:18
         select: {
             id: true,
             id_usuario: true,
-            cpf: false,
+            cpf: true,
             telefone: true
         }

[NoCoverage] BooleanLiteral
src/Model/LeitorModel.js:52:23
             id: true,
             id_usuario: true,
             cpf: false,
-            telefone: true
+            telefone: false
         }
     })

[NoCoverage] BlockStatement
src/Model/LeitorModel.js:59:36
     return result
 }
 
-export async function listLeitor() {
-    const result = await prisma.Leitor.findMany({
-        select: {
-            id: true,
-            id_usuario: true,
-            cpf: false,
-            telefone: true
-        }
-    })
-
-    return result
-}
+export async function listLeitor() {}
 
 export async function getLeitorById(id) {

[NoCoverage] ObjectLiteral
src/Model/LeitorModel.js:61:17
 
 export async function listLeitor() {
     const result = await prisma.Leitor.findMany({
-        select: {
-            id: true,
-            id_usuario: true,
-            cpf: false,
-            telefone: true
-        }
+        select: {}
     })
 

[NoCoverage] BlockStatement
src/Model/LeitorModel.js:72:41
     return result
 }
 
-export async function getLeitorById(id) {
-    const result = await prisma.Leitor.findUnique({
-        where: {
-            id: id
-        }, select: {
-            id: true,
-            id_usuario: true,
-            cpf: false,
-            telefone: true
-        }
-    })
-
-    return result
-}
+export async function getLeitorById(id) {}
 
 export async function deleteLeitor(id) {

[NoCoverage] ObjectLiteral
src/Model/LeitorModel.js:73:51
 }
 
 export async function getLeitorById(id) {
-    const result = await prisma.Leitor.findUnique({
-        where: {
-            id: id
-        }, select: {
-            id: true,
-            id_usuario: true,
-            cpf: false,
-            telefone: true
-        }
-    })
+    const result = await prisma.Leitor.findUnique({})
 
     return result

[NoCoverage] ObjectLiteral
src/Model/LeitorModel.js:76:20
     const result = await prisma.Leitor.findUnique({
         where: {
             id: id
-        }, select: {
-            id: true,
-            id_usuario: true,
-            cpf: false,
-            telefone: true
-        }
+        }, select: {}
     })
 

[NoCoverage] BlockStatement
src/Model/LeitorModel.js:87:40
     return result
 }
 
-export async function deleteLeitor(id) {
-    const result = await prisma.Leitor.delete({
-        where: {
-            id: id
-        }, select: {
-            id: true,
-            id_usuario: true,
-            cpf: false,
-            telefone: true
-        }
-    })
-
-    return result
-}
+export async function deleteLeitor(id) {}
 
 export async function updateLeitor(leitor, id) {

[NoCoverage] BlockStatement
src/Model/LeitorModel.js:102:48
     return result
 }
 
-export async function updateLeitor(leitor, id) {
-    const result = await prisma.Leitor.update({
-        where: {
-            id: id
-        }, data: {
-            leitor
-        }, select: {
-            id: true,
-            id_usuario: true,
-            cpf: false,
-            telefone: true
-        }
-    })
-
-    return result
-}
+export async function updateLeitor(leitor, id) {}

[NoCoverage] ObjectLiteral
src/Model/LeitorModel.js:106:18
     const result = await prisma.Leitor.update({
         where: {
             id: id
-        }, data: {
-            leitor
-        }, select: {
+        }, data: {}, select: {
             id: true,
             id_usuario: true,

[NoCoverage] ObjectLiteral
src/Model/LeitorModel.js:108:20
             id: id
         }, data: {
             leitor
-        }, select: {
-            id: true,
-            id_usuario: true,
-            cpf: false,
-            telefone: true
-        }
+        }, select: {}
     })
 
