[NoCoverage] BlockStatement
src/Model/ObraAutorModel.js:5:49
 
 const prisma = new PrismaClient()
 
-export async function createObraAutor(obraAutor){
-    const result = await prisma.ObraAutor.create({
-        data: obraAutor,
-        select: {
-            id_autor: true,
-            id_obra: true
-        }
-    })
-
-    return result
-}
+export async function createObraAutor(obraAutor){}
 
 export async function listObraAutor(){

[NoCoverage] ObjectLiteral
src/Model/ObraAutorModel.js:6:50
 const prisma = new PrismaClient()
 
 export async function createObraAutor(obraAutor){
-    const result = await prisma.ObraAutor.create({
-        data: obraAutor,
-        select: {
-            id_autor: true,
-            id_obra: true
-        }
-    })
+    const result = await prisma.ObraAutor.create({})
 
     return result

[NoCoverage] ObjectLiteral
src/Model/ObraAutorModel.js:8:17
 export async function createObraAutor(obraAutor){
     const result = await prisma.ObraAutor.create({
         data: obraAutor,
-        select: {
-            id_autor: true,
-            id_obra: true
-        }
+        select: {}
     })
 

[NoCoverage] BooleanLiteral
src/Model/ObraAutorModel.js:9:23
     const result = await prisma.ObraAutor.create({
         data: obraAutor,
         select: {
-            id_autor: true,
+            id_autor: false,
             id_obra: true
         }

[NoCoverage] BooleanLiteral
src/Model/ObraAutorModel.js:10:22
         data: obraAutor,
         select: {
             id_autor: true,
-            id_obra: true
+            id_obra: false
         }
     })

[NoCoverage] BlockStatement
src/Model/ObraAutorModel.js:17:38
     return result
 }
 
-export async function listObraAutor(){
-    const result = await prisma.ObraAutor.findMany({
-        select: {
-            id_autor: true,
-            id_obra: true
-        }
-    })
-
-    return result
-}
+export async function listObraAutor(){}
 
 export async function getObraAutorByIdObra(id_obra) {

[NoCoverage] BlockStatement
src/Model/ObraAutorModel.js:28:53
     return result
 }
 
-export async function getObraAutorByIdObra(id_obra) {
-    const result = await prisma.ObraAutor.findMany({
-        where: {
-            id_obra: id_obra
-        }, 
-        select: {
-            id_autor: true,
-            id_obra: true
-        }
-    })
-
-    return result
-}
+export async function getObraAutorByIdObra(id_obra) {}
 
 export async function getObraAutorByIdAutor(id_autor) {

[NoCoverage] ObjectLiteral
src/Model/ObraAutorModel.js:33:17
         where: {
             id_obra: id_obra
         }, 
-        select: {
-            id_autor: true,
-            id_obra: true
-        }
+        select: {}
     })
 

[NoCoverage] BlockStatement
src/Model/ObraAutorModel.js:42:55
     return result
 }
 
-export async function getObraAutorByIdAutor(id_autor) {
-    const result = await prisma.ObraAutor.findMany({
-        where: {
-            id_autor: id_autor
-        }, 
-        select: {
-            id_autor: true,
-            id_obra: true
-        }
-    })
-
-    return result
-}
+export async function getObraAutorByIdAutor(id_autor) {}
 
 export async function deleteObraAutor(id_autor, id_obra) {

[NoCoverage] BlockStatement
src/Model/ObraAutorModel.js:56:58
     return result
 }
 
-export async function deleteObraAutor(id_autor, id_obra) {
-    const result = await prisma.ObraAutor.delete({
-        where: {
-            id_autor: id_autor,
-            id_obra: id_obra
-        },
-        select: {
-            id_autor: true,
-            id_obra: true
-        }
-    })
-
-    return result
-}
+export async function deleteObraAutor(id_autor, id_obra) {}

[NoCoverage] ObjectLiteral
src/Model/ObraAutorModel.js:57:50
 }
 
 export async function deleteObraAutor(id_autor, id_obra) {
-    const result = await prisma.ObraAutor.delete({
-        where: {
-            id_autor: id_autor,
-            id_obra: id_obra
-        },
-        select: {
-            id_autor: true,
-            id_obra: true
-        }
-    })
+    const result = await prisma.ObraAutor.delete({})
 
     return result
