[NoCoverage] ObjectLiteral
src/Model/ObraModel.js:20:33
         invalid_type_error: "A editora deve ser um valor tipo texto"
     }).optional(),
 
-    numeroPaginas: new z.number({
-        invalid_type_error: "O número de páginas deve ser um valor numérico",
-        required_error: "O número de páginas deve ser obrigatorio"
-    }),
+    numeroPaginas: new z.number({}),
 
     ativa: z.boolean().default(true)

[NoCoverage] StringLiteral
src/Model/ObraModel.js:21:29
     }).optional(),
 
     numeroPaginas: new z.number({
-        invalid_type_error: "O número de páginas deve ser um valor numérico",
+        invalid_type_error: "",
         required_error: "O número de páginas deve ser obrigatorio"
     }),

[NoCoverage] BooleanLiteral
src/Model/ObraModel.js:25:32
         required_error: "O número de páginas deve ser obrigatorio"
     }),
 
-    ativa: z.boolean().default(true)
+    ativa: z.boolean().default(false)
 })
 

[NoCoverage] BlockStatement
src/Model/ObraModel.js:28:56
     ativa: z.boolean().default(true)
 })
 
-export const obraValidator = (obra, partial = null) => {
-    if (partial) {
-        return obraSchema.partial(partial).safeParse(obra)
-    }
-
-    return obraSchema.safeParse(obra)
-}
+export const obraValidator = (obra, partial = null) => {}
 
 export async function createObra(obra) {

[NoCoverage] ConditionalExpression
src/Model/ObraModel.js:29:9
 })
 
 export const obraValidator = (obra, partial = null) => {
-    if (partial) {
+    if (true) {
         return obraSchema.partial(partial).safeParse(obra)
     }

[NoCoverage] ConditionalExpression
src/Model/ObraModel.js:29:9
 })
 
 export const obraValidator = (obra, partial = null) => {
-    if (partial) {
+    if (false) {
         return obraSchema.partial(partial).safeParse(obra)
     }

[NoCoverage] BlockStatement
src/Model/ObraModel.js:36:40
     return obraSchema.safeParse(obra)
 }
 
-export async function createObra(obra) {
-    const result = await prisma.Obra.create({
-        data: obra,
-        select: {
-            id: true,
-            id_cdd: true,
-            titulo: true,
-            subtitulo: true,
-            editora: true,
-            numeroPaginas: true,
-            capa: true,
-            ativa: true,
-            notaMedia: true
-        }
-    })
-
-    return result
-}
+export async function createObra(obra) {}
 
 export async function listObra() {

[NoCoverage] BooleanLiteral
src/Model/ObraModel.js:41:21
         data: obra,
         select: {
             id: true,
-            id_cdd: true,
+            id_cdd: false,
             titulo: true,
             subtitulo: true,

[NoCoverage] BooleanLiteral
src/Model/ObraModel.js:42:21
         select: {
             id: true,
             id_cdd: true,
-            titulo: true,
+            titulo: false,
             subtitulo: true,
             editora: true,

[NoCoverage] BooleanLiteral
src/Model/ObraModel.js:43:24
             id: true,
             id_cdd: true,
             titulo: true,
-            subtitulo: true,
+            subtitulo: false,
             editora: true,
             numeroPaginas: true,

[NoCoverage] BooleanLiteral
src/Model/ObraModel.js:44:22
             id_cdd: true,
             titulo: true,
             subtitulo: true,
-            editora: true,
+            editora: false,
             numeroPaginas: true,
             capa: true,

[NoCoverage] BooleanLiteral
src/Model/ObraModel.js:45:28
             titulo: true,
             subtitulo: true,
             editora: true,
-            numeroPaginas: true,
+            numeroPaginas: false,
             capa: true,
             ativa: true,

[NoCoverage] BooleanLiteral
src/Model/ObraModel.js:46:19
             subtitulo: true,
             editora: true,
             numeroPaginas: true,
-            capa: true,
+            capa: false,
             ativa: true,
             notaMedia: true

[NoCoverage] BooleanLiteral
src/Model/ObraModel.js:47:20
             editora: true,
             numeroPaginas: true,
             capa: true,
-            ativa: true,
+            ativa: false,
             notaMedia: true
         }

[NoCoverage] BooleanLiteral
src/Model/ObraModel.js:48:24
             numeroPaginas: true,
             capa: true,
             ativa: true,
-            notaMedia: true
+            notaMedia: false
         }
     })

[NoCoverage] BlockStatement
src/Model/ObraModel.js:55:34
     return result
 }
 
-export async function listObra() {
-    const result = await prisma.Obra.findMany({
-        select: {
-            id: true,
-            id_cdd: true,
-            titulo: true,
-            subtitulo: true,
-            editora: true,
-            numeroPaginas: true,
-            capa: true,
-            ativa: true,
-            notaMedia: true
-        }
-    })
-
-    return result
-}
+export async function listObra() {}
 
 export async function getObraById(id) {

[NoCoverage] ObjectLiteral
src/Model/ObraModel.js:57:17
 
 export async function listObra() {
     const result = await prisma.Obra.findMany({
-        select: {
-            id: true,
-            id_cdd: true,
-            titulo: true,
-            subtitulo: true,
-            editora: true,
-            numeroPaginas: true,
-            capa: true,
-            ativa: true,
-            notaMedia: true
-        }
+        select: {}
     })
 

[NoCoverage] BlockStatement
src/Model/ObraModel.js:73:39
     return result
 }
 
-export async function getObraById(id) {
-    const result = await prisma.Obra.findUnique({
-        where: {
-            id: id
-        },
-        select: {
-            id: true,
-            id_cdd: true,
-            titulo: true,
-            subtitulo: true,
-            editora: true,
-            numeroPaginas: true,
-            capa: true,
-            ativa: true,
-            notaMedia: true
-        }
-    })
-
-    return result
-
-}
+export async function getObraById(id) {}
 
 export async function deleteObra(id) {

[NoCoverage] ObjectLiteral
src/Model/ObraModel.js:75:16
 
 export async function getObraById(id) {
     const result = await prisma.Obra.findUnique({
-        where: {
-            id: id
-        },
+        where: {},
         select: {
             id: true,

[NoCoverage] BlockStatement
src/Model/ObraModel.js:95:38
 
 }
 
-export async function deleteObra(id) {
-    const result = await prisma.Obra.delete({
-        where: {
-            id: id
-        },
-        select: {
-            id: true,
-            id_cdd: true,
-            titulo: true,
-            subtitulo: true,
-            editora: true,
-            numeroPaginas: true,
-            capa: true,
-            ativa: true,
-            notaMedia: true
-        }
-    })
-
-    return result
-}
+export async function deleteObra(id) {}
 
 export async function updateObra(id, obra) {

[NoCoverage] BlockStatement
src/Model/ObraModel.js:116:44
     return result
 }
 
-export async function updateObra(id, obra) {
-    const result = await prisma.Obra.update({
-        where: {
-            id: id
-        },
-        data: obra,
-        select: {
-            id: true,
-            id_cdd: true,
-            titulo: true,
-            subtitulo: true,
-            editora: true,
-            numeroPaginas: true,
-            capa: true,
-            ativa: true,
-            notaMedia: true
-        }
-    })
-
-    return result
-}
+export async function updateObra(id, obra) {}
 

[NoCoverage] ObjectLiteral
src/Model/ObraModel.js:118:16
 
 export async function updateObra(id, obra) {
     const result = await prisma.Obra.update({
-        where: {
-            id: id
-        },
+        where: {},
         data: obra,
         select: {

[NoCoverage] ObjectLiteral
src/Model/ObraModel.js:122:17
             id: id
         },
         data: obra,
-        select: {
-            id: true,
-            id_cdd: true,
-            titulo: true,
-            subtitulo: true,
-            editora: true,
-            numeroPaginas: true,
-            capa: true,
-            ativa: true,
-            notaMedia: true
-        }
+        select: {}
     })
 
