[NoCoverage] ObjectLiteral
src/Model/UsuarioModel.js:7:36
 
 const prisma = new PrismaClient()
 
-const usuarioSchema = new z.object({
-    nome: z.string({
-        invalid_type_error: "O nome deve ser um valor tipo texto",
-        required_error: "O nome deve ser obrigatorio"
-    })
-    .max(20, "Nome deve ter no máximo 40 caracteres!")
-    .min(4, "Nome deve ter no mínimo 20 caracteres!"),
-    
-    email: z.string({
-        invalid_type_error: "O nome deve ser um valor tipo texto",
-        required_error: "O nome deve ser obrigatorio"
-    })
-
-})
+const usuarioSchema = new z.object({})
 
 export const usuarioValidator = (usuario, partial = null) => {

[NoCoverage] MethodExpression
src/Model/UsuarioModel.js:8:11
 const prisma = new PrismaClient()
 
 const usuarioSchema = new z.object({
-    nome: z.string({
-        invalid_type_error: "O nome deve ser um valor tipo texto",
-        required_error: "O nome deve ser obrigatorio"
-    })
-    .max(20, "Nome deve ter no máximo 40 caracteres!")
+    nome: z.string({
+  invalid_type_error: "O nome deve ser um valor tipo texto",
+  required_error: "O nome deve ser obrigatorio"
+}).min(20, "Nome deve ter no máximo 40 caracteres!")
     .min(4, "Nome deve ter no mínimo 20 caracteres!"),
     

[NoCoverage] MethodExpression
src/Model/UsuarioModel.js:8:11
 const prisma = new PrismaClient()
 
 const usuarioSchema = new z.object({
-    nome: z.string({
-        invalid_type_error: "O nome deve ser um valor tipo texto",
-        required_error: "O nome deve ser obrigatorio"
-    })
-    .max(20, "Nome deve ter no máximo 40 caracteres!")
-    .min(4, "Nome deve ter no mínimo 20 caracteres!"),
+    nome: z.string({
+  invalid_type_error: "O nome deve ser um valor tipo texto",
+  required_error: "O nome deve ser obrigatorio"
+}).max(20, "Nome deve ter no máximo 40 caracteres!").max(4, "Nome deve ter no mínimo 20 caracteres!"),
     
     email: z.string({

[NoCoverage] StringLiteral
src/Model/UsuarioModel.js:9:29
 
 const usuarioSchema = new z.object({
     nome: z.string({
-        invalid_type_error: "O nome deve ser um valor tipo texto",
+        invalid_type_error: "",
         required_error: "O nome deve ser obrigatorio"
     })

[NoCoverage] StringLiteral
src/Model/UsuarioModel.js:10:25
 const usuarioSchema = new z.object({
     nome: z.string({
         invalid_type_error: "O nome deve ser um valor tipo texto",
-        required_error: "O nome deve ser obrigatorio"
+        required_error: ""
     })
     .max(20, "Nome deve ter no máximo 40 caracteres!")

[NoCoverage] StringLiteral
src/Model/UsuarioModel.js:12:14
         invalid_type_error: "O nome deve ser um valor tipo texto",
         required_error: "O nome deve ser obrigatorio"
     })
-    .max(20, "Nome deve ter no máximo 40 caracteres!")
+    .max(20, "")
     .min(4, "Nome deve ter no mínimo 20 caracteres!"),
     

[NoCoverage] ObjectLiteral
src/Model/UsuarioModel.js:15:21
     .max(20, "Nome deve ter no máximo 40 caracteres!")
     .min(4, "Nome deve ter no mínimo 20 caracteres!"),
     
-    email: z.string({
-        invalid_type_error: "O nome deve ser um valor tipo texto",
-        required_error: "O nome deve ser obrigatorio"
-    })
+    email: z.string({})
 
 })

[NoCoverage] BlockStatement
src/Model/UsuarioModel.js:22:62
 
 })
 
-export const usuarioValidator = (usuario, partial = null) => {
-    if(partial){
-        return usuarioSchema.partial(partial).safeParse(usuario)
-    }
-
-    return usuarioSchema.safeParse(usuario)
-}
+export const usuarioValidator = (usuario, partial = null) => {}
 
 export async function createUsuario(usuario) {

[NoCoverage] ConditionalExpression
src/Model/UsuarioModel.js:23:8
 })
 
 export const usuarioValidator = (usuario, partial = null) => {
-    if(partial){
+    if(false){
         return usuarioSchema.partial(partial).safeParse(usuario)
     }

[NoCoverage] BlockStatement
src/Model/UsuarioModel.js:23:16
 })
 
 export const usuarioValidator = (usuario, partial = null) => {
-    if(partial){
-        return usuarioSchema.partial(partial).safeParse(usuario)
-    }
+    if(partial){}
 
     return usuarioSchema.safeParse(usuario)

[NoCoverage] BlockStatement
src/Model/UsuarioModel.js:30:46
     return usuarioSchema.safeParse(usuario)
 }
 
-export async function createUsuario(usuario) {
-    const data = {
-        nome: usuario.nome,
-        email: usuario.email,
-        hash: await bcrypt.hash(usuario.hash, 10)
-    }
-    
-    const result = await prisma.Usuario.create({
-        data: data,
-        select: {
-            id: true,
-            nome: true,
-            email: true,
-            hash: false
-        }
-    })
-
-    return result
-}
+export async function createUsuario(usuario) {}
 
 export async function listUsuario() {

[NoCoverage] BooleanLiteral
src/Model/UsuarioModel.js:41:19
         data: data,
         select: {
             id: true,
-            nome: true,
+            nome: false,
             email: true,
             hash: false

[NoCoverage] BooleanLiteral
src/Model/UsuarioModel.js:42:20
         select: {
             id: true,
             nome: true,
-            email: true,
+            email: false,
             hash: false
         }

[NoCoverage] BooleanLiteral
src/Model/UsuarioModel.js:43:19
             id: true,
             nome: true,
             email: true,
-            hash: false
+            hash: true
         }
     })

[NoCoverage] BlockStatement
src/Model/UsuarioModel.js:50:37
     return result
 }
 
-export async function listUsuario() {
-    const result = await prisma.Usuario.findMany({
-        select: {
-            id: true,
-            nome: true,
-            email: true,
-            hash: false
-        }
-    })
-
-    return result
-}
+export async function listUsuario() {}
 
 export async function getUsuarioById(id){

[NoCoverage] ObjectLiteral
src/Model/UsuarioModel.js:52:17
 
 export async function listUsuario() {
     const result = await prisma.Usuario.findMany({
-        select: {
-            id: true,
-            nome: true,
-            email: true,
-            hash: false
-        }
+        select: {}
     })
 

[NoCoverage] BlockStatement
src/Model/UsuarioModel.js:63:41
     return result
 }
 
-export async function getUsuarioById(id){
-    const result = await prisma.Usuario.findUnique({
-        where: {
-            id: id
-        },
-        select: {
-            id: true,
-            nome: true,
-            email: true,
-            hash: false
-        }
-    })
-
-    return result
-} 
+export async function getUsuarioById(id){} 
 
 export async function deleteUsuario(id) {

[NoCoverage] BlockStatement
src/Model/UsuarioModel.js:79:41
     return result
 } 
 
-export async function deleteUsuario(id) {
-    const result = await prisma.Usuario.delete({
-        where: {
-            id: id
-        },
-        select: {
-            id: true,
-            nome: true,
-            email: true,
-            hash: false
-        }
-    })
-
-    return result
-}
+export async function deleteUsuario(id) {}
 
 export async function updateUsuario(usuario, id) {

[NoCoverage] ObjectLiteral
src/Model/UsuarioModel.js:80:48
 } 
 
 export async function deleteUsuario(id) {
-    const result = await prisma.Usuario.delete({
-        where: {
-            id: id
-        },
-        select: {
-            id: true,
-            nome: true,
-            email: true,
-            hash: false
-        }
-    })
+    const result = await prisma.Usuario.delete({})
 
     return result

[NoCoverage] BlockStatement
src/Model/UsuarioModel.js:95:50
     return result
 }
 
-export async function updateUsuario(usuario, id) {
-    const data = {
-        id: id,
-        nome: usuario.nome,
-        email: usuario.email,
-        hash: await bcrypt.hash(usuario.hash, 10)
-    }
-    
-    const result = await prisma.Usuario.update({
-        data: data,
-        where: {
-            id: id
-        },
-        select: {
-            id: true,
-            nome: true,
-            email: true,
-            hash: false
-        }
-    })
-
-    return result
-    
-}
+export async function updateUsuario(usuario, id) {}
 
 export async function getUsuarioByEmail(email){

[NoCoverage] ObjectLiteral
src/Model/UsuarioModel.js:105:16
     
     const result = await prisma.Usuario.update({
         data: data,
-        where: {
-            id: id
-        },
+        where: {},
         select: {
             id: true,

[NoCoverage] ObjectLiteral
src/Model/UsuarioModel.js:108:17
         where: {
             id: id
         },
-        select: {
-            id: true,
-            nome: true,
-            email: true,
-            hash: false
-        }
+        select: {}
     })
 

[NoCoverage] BlockStatement
src/Model/UsuarioModel.js:120:47
     
 }
 
-export async function getUsuarioByEmail(email){
-    const result = prisma.Usuario.findUnique({
-        where: {
-            email: email
-        }, select: {
-            id: true,
-            nome: true,
-            email: true,
-            hash: true
-        }
-    })
-
-    return result
-}
+export async function getUsuarioByEmail(email){}
 
 export async function getBibliotecarioByUsuarioId(id_usuario){

[NoCoverage] BooleanLiteral
src/Model/UsuarioModel.js:128:19
             id: true,
             nome: true,
             email: true,
-            hash: true
+            hash: false
         }
     })

[NoCoverage] BlockStatement
src/Model/UsuarioModel.js:135:62
     return result
 }
 
-export async function getBibliotecarioByUsuarioId(id_usuario){
-    const result = prisma.bibliotecario.findMany({
-        where: {
-            id_usuario: id_usuario
-        }, select: {
-            id: true,
-            id_usuario: true
-        }
-    })
-    
-    return result
-}
+export async function getBibliotecarioByUsuarioId(id_usuario){}
